murr2k/RP2350/esp32-s3-touch-lcd-2.1/sdkconfig.defaults
# Defaults for the Waveshare ESP32-S3-Touch-LCD-2.1 (ESP32-S3R8: 8 MB octal PSRAM).
# Delete sdkconfig and re-run `idf.py build` after changing anything here.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash -------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM -------------------------------------------------------------------
# The 480x480 RGB565 frame buffers (450 KB each, two of them) live in PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Keeping code and constants in PSRAM instead of flash stops the RGB panel from
# starving when the cache fetches from flash, which otherwise shows up as the
# picture drifting sideways. The alternative is a bounce buffer, see lcd_2in1.c.
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# --- RGB panel ---------------------------------------------------------------
# The panel has no frame buffer: its interrupt composes each bounce buffer from
# the display list (see lcd_2in1.c and gfx.c). That rasteriser calls into libm
# and lives in PSRAM, so the ISR cannot be marked IRAM safe. Nothing here writes
# flash at runtime, which is the only thing that would disable the cache under
# it. Restarting on VSYNC keeps any residual desync from accumulating.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=n
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# --- CPU / cache -------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- Console -----------------------------------------------------------------
# The board has two USB-C sockets. The one marked UART goes through a bridge
# chip to UART0, enumerates no matter what the firmware is doing, and is what
# esptool talks to. Making it the primary console means one cable flashes the
# board, shows the logs and drives the demo CLIs.
#
# The socket marked USB is the ESP32-S3's native USB. It stays wired up as the
# secondary console, so log output appears there too, but it is output only:
# keyboard input for the demo menus comes from the UART socket. Swap these two
# lines for CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y to invert that.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# --- FreeRTOS ----------------------------------------------------------------
# 1 kHz tick so that the 5 ms / 10 ms demo loop delays keep their meaning.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi and IP event handlers run on this one, and the full printf below wants
# far more stack than the cut down version the default size assumes. At 2304 it
# overflowed inside the event loop and brought the system down with a corrupted
# mutex, which reads as a FreeRTOS queue assert and not as a stack problem.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# --- Build -------------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Every demo prints floats, so keep the full printf implementation.
CONFIG_NEWLIB_NANO_FORMAT=n
